snlkuharlocal/src/DataProcessors/ФормированиеИОбработкаЗаказовКМ/ФормированиеИОбработкаЗаказовКМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ФормированиеИОбработкаЗаказовКМ</name>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаказыКМ</name>
    <attributes>
      <name>ЗаказКМ</name>
      <type>
        <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/Enums/СтатусыДокументовМаркировки/СтатусыДокументовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументовМаркировки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОтложеннойОбработки</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Обрабатывается</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОбработанЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиЧЗ</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаказНаЭмиссиюКодовМаркировкиСУЗ/ЗаказНаЭмиссиюКодовМаркировкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаЭмиссиюКодовМаркировкиСУЗ</name>
  <comment>Заказ на эмиссию кодов маркировки СУЗ</comment>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_ЧЗ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.КонтрактСПроизводителем</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемаркировка</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ДокументаЧЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоКодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоКодовИзЧЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатурыЧЗВДокументе</name>
    <type>
      <types>EnumRef.ВидыНоменклатурыЧЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеНанесения</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВводаВОборот</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаЗапланирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКомплекта</name>
    <type>
      <types>EnumRef.ВидыКомплектов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомплект</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоКодовКомплект</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ГТИН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКомплект</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.Комплектация</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/DataProcessors/ФормированиеИОбработкаЗаказовКМ/Forms/ФормаУправляемая/Module.bsl
&НаСервере
Процедура ОтправитьНаОтработкуНаСервере()
	ОбОбработка = РеквизитФормыВЗначение("Объект");
	ОбОбработка.Организация = Организация;
	ОбОбработка.Подразделение = Подразделение;                  
	ОбОбработка.ОтправитьНаОтработкуВЧЗЗАказыКМ(ЗаказыКМ.ВыгрузитьЗначения()); 
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаОтработку(Команда)
	ОтправитьНаОтработкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЭтапВторойНаСервере()
	ОбОбработка = РеквизитФормыВЗначение("Объект");
	ОбОбработка.Организация = Организация;
	ОбОбработка.Подразделение = Подразделение;
	ОбОбработка.ЭтапВторой();
КонецПроцедуры

&НаКлиенте
Процедура ЭтапВторой(Команда)
	ЭтапВторойНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЭтапТретийНаСервере()
	ОбОбработка = РеквизитФормыВЗначение("Объект");
	ОбОбработка.Организация = Организация;
	ОбОбработка.Подразделение = Подразделение;
	ОбОбработка.ЭтапТретий();
КонецПроцедуры

&НаКлиенте
Процедура ЭтапТретий(Команда)
	ЭтапТретийНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЭтапПервыйНаСервере()
	ОбОбработка = РеквизитФормыВЗначение("Объект");
	ОбОбработка.Организация = Организация;
	ОбОбработка.Подразделение = Подразделение;
	
	ПараметрыОбработки = Новый Структура; 
	ПараметрыОбработки.Вставить("Организация",Организация);
	ПараметрыОбработки.Вставить("Подразделение",Подразделение.ВыгрузитьЗначения());
	ОбОбработка.ЭтапПервый(ПараметрыОбработки); 	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапПервый(Команда)
	ЭтапПервыйНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЭтапЧетвертыйНаСервере()
	ОбОбработка = РеквизитФормыВЗначение("Объект");
	ОбОбработка.Организация = Организация;
	ОбОбработка.Подразделение = Подразделение;
	ОбОбработка.ЭтапЧетвертый();
КонецПроцедуры

&НаКлиенте
Процедура ЭтапЧетвертый(Команда)
	ЭтапЧетвертыйНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЭтапПятыйНаСервере()
	ОбОбработка = РеквизитФормыВЗначение("Объект");
	ОбОбработка.Организация = Организация;
	ОбОбработка.Подразделение = Подразделение;
	ОбОбработка.ЭтапПятый();
КонецПроцедуры

&НаКлиенте
Процедура ЭтапПятый(Команда)
	ЭтапПятыйНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЭтапШестойНаСервере()
	ОбОбработка = РеквизитФормыВЗначение("Объект");
	ОбОбработка.Организация = Организация;
	ОбОбработка.Подразделение = Подразделение;
	ОбОбработка.ЭтапШестой();

КонецПроцедуры

&НаКлиенте
Процедура ЭтапШестой(Команда)
	ЭтапШестойНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЭтапСедьмойНаСервере() 
	
	ОбОбработка = РеквизитФормыВЗначение("Объект");
	ОбОбработка.Организация = Организация;
	ОбОбработка.Подразделение = Подразделение;
	ОбОбработка.ЭтапСедьмой();


КонецПроцедуры

&НаКлиенте
Процедура ЭтапСедьмой(Команда)
	ЭтапСедьмойНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЭтапВосьмойНаСервере() 
	
	ОбОбработка = РеквизитФормыВЗначение("Объект");
	ОбОбработка.Организация = Организация;
	ОбОбработка.Подразделение = Подразделение;
	
	ПараметрыОбработки = Новый Структура; 
	ПараметрыОбработки.Вставить("Организация",Организация);
	ПараметрыОбработки.Вставить("Подразделение",Подразделение.ВыгрузитьЗначения());
	
	ОбОбработка.ЭтапВосьмой(ПараметрыОбработки);  
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапВосьмой(Команда)
	ЭтапВосьмойНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПарольДоступаКЗакрытомуКлючу(Команда)
	
	ПарольДоступаКЗакрытомуКлючу = ""; 
	
	ОписаниеВвода = Новый ОписаниеОповещения("ПослеВВодаКлюча",ЭтаФорма); 
	
	ПоказатьВводЗначения(ОписаниеВвода,ПарольДоступаКЗакрытомуКлючу,"Введите пароль к ключу ЭЦП"); 
	
	//ВвестиЗначение(ПарольДоступаКЗакрытомуКлючу, "Введите пароль к ключу ЭЦП");
		
КонецПроцедуры
	
	// <Описание процедуры>
	//
	// Параметры:
	//  <Параметр1>  - <Тип.Вид> - <описание параметра>
	//                 <продолжение описания параметра>
	//  <Параметр2>  - <Тип.Вид> - <описание параметра>
	//                 <продолжение описания параметра>
	//
&НаКлиенте
Процедура ПослеВВодаКлюча(ЗначениеВвода,ДополнительныеПараметры) Экспорт 
	
	Если ЗначениеВвода <> неопределено Тогда
		
		ПослеВВодаКлючаНаСервере(ЗначениеВвода);   	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеВВодаКлючаНаСервере(Знач ЗначениеВвода)
	
	Перем КлючОбъекта_ДляНастроек;
	
	КлючОбъекта_ДляНастроек = "АпиЧЗ";
	
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта_ДляНастроек, "ПарольДоступаКЗакрытомуКлючу", ЗначениеВвода);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаказыНаЭмиссиюНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	                      |ГДЕ
	                      |	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Проведен
	                      |	И ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Дата >= ДАТАВРЕМЯ(2025, 8, 1)
	                      |	И ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Статус = Значение(Перечисление.СтатусыДокументовМаркировки.Вработе)");
	ЗаказыКМ.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗаказыНаЭмиссию(Команда)
	ЗаполнитьЗаказыНаЭмиссиюНаСервере();
КонецПроцедуры
 // ()
